i998/Arduino_MVC_STM32/src/SSD1306_i2c.cpp
  // x is which column
    switch (color) 
    {
      case WHITE:   buffer[x+ (y/8)*SSD1306_LCDWIDTH] |=  (1 << (y&7)); break;
      case BLACK:   buffer[x+ (y/8)*SSD1306_LCDWIDTH] &= ~(1 << (y&7)); break; 
      case INVERSE: buffer[x+ (y/8)*SSD1306_LCDWIDTH] ^=  (1 << (y&7)); break; 
    }
    
}





/**************************************************************************/
/*! 
    @brief  Instantiates a new SSD1306_i2c driver with a pointer to I2C interface (TwoWire)
    @param  i2c  A pointer to a 'Wire' compatible object that we'll use to communicate with
    @param  rstPin A pin that is used to reset the display
*/
/**************************************************************************/

// Constructor for I2C - all default 
 SSD1306_i2c::SSD1306_i2c(void) : Adafruit_GFX(SSD1306_LCDWIDTH, SSD1306_LCDHEIGHT) {
  sclk = dc = cs = sid = -1;
  rst = -1;
 
    // Core test 
	#ifdef ARDUINO_ARCH_STM32           // official "stm32duino core"
	   _i2c = &Wire;   
	#elif defined(ARDUINO_ARCH_STM32F1)     //Roger Clark "libmaple core"
	  _i2c = &Wire;  
	#elif defined(ARDUINO_ARCH_STM32F4)    //Roger Clark "libmaple f4 core"
	  _i2c = &Wire; 
	#elif defined(__AVR__)  // Arduino 
	  _i2c = &Wire;
	#elif defined(__arm__)  // Arduino
	   _i2c = &Wire;
	#elif defined(ARDUINO_SAM_DUE)
	  _i2c = &Wire1;   
	#else   //  "unknown core"
		  Wire *_i2c;
	#endif
}
	
// Constructor for I2C - with pointer  
SSD1306_i2c::SSD1306_i2c(TwoWire *i2c) : Adafruit_GFX(SSD1306_LCDWIDTH, SSD1306_LCDHEIGHT) {
  sclk = dc = cs = sid = -1;
  rst = -1;
  _i2c = i2c;
}
			  
// Constructor for I2C - with pointer  and reset pin
SSD1306_i2c::SSD1306_i2c(TwoWire *i2c, uint8_t rstPin): Adafruit_GFX(SSD1306_LCDWIDTH, SSD1306_LCDHEIGHT) {
  sclk = dc = cs = sid = -1;
  rst = rstPin;
  _i2c = i2c;
}


/**************************************************************************/
/*! 
    @brief  Initializes the SSD1306_i2c driver and starts I2C interface
    @param  vccstate  SSD1306 configuration for power 
	@param  i2caddr   I2C address for the display
    @param  reset     A boolean parameter to indicate if reset is required 
*/
/**************************************************************************/

void SSD1306_i2c::SSD1306_i2c::begin(uint8_t vccstate, uint8_t i2caddr, bool reset) {
#ifdef ENABLE_DEBUG_OUTPUT_SSD1306_i2c
  Serial.println("SSD1306_i2c::begin stated"); 
#endif

  _vccstate = vccstate;
  _i2caddr = i2caddr;
    // I2C Init
  _i2c->begin();
 

 
  if (reset) {
    // Setup reset pin direction if used   
    pinMode(rst, OUTPUT);
    digitalWrite(rst, HIGH);
    // VDD (3.3V) goes high at start, lets just chill for a ms
    delay(1);
    // bring reset low
    digitalWrite(rst, LOW);
    // wait 10ms
    delay(10);
    // bring out of reset
    digitalWrite(rst, HIGH);
    // turn on VCC (9V?)
  }

  
  
   #if defined SSD1306_128_32
    // Init sequence for 128x32 OLED module
    ssd1306_command(SSD1306_DISPLAYOFF);                    // 0xAE
    ssd1306_command(SSD1306_SETDISPLAYCLOCKDIV);            // 0xD5
    ssd1306_command(0x80);                                  // the suggested ratio 0x80
    ssd1306_command(SSD1306_SETMULTIPLEX);                  // 0xA8
    ssd1306_command(0x1F);
    ssd1306_command(SSD1306_SETDISPLAYOFFSET);              // 0xD3
    ssd1306_command(0x0);                                   // no offset
    ssd1306_command(SSD1306_SETSTARTLINE | 0x0);            // line #0
    ssd1306_command(SSD1306_CHARGEPUMP);                    // 0x8D
    if (vccstate == SSD1306_EXTERNALVCC) 
      { ssd1306_command(0x10); }
    else 
      { ssd1306_command(0x14); }
    ssd1306_command(SSD1306_MEMORYMODE);                    // 0x20
    ssd1306_command(0x00);                                  // 0x0 act like ks0108
    ssd1306_command(SSD1306_SEGREMAP | 0x1);
    ssd1306_command(SSD1306_COMSCANDEC);
    ssd1306_command(SSD1306_SETCOMPINS);                    // 0xDA
    ssd1306_command(0x02);
    ssd1306_command(SSD1306_SETCONTRAST);                   // 0x81
    ssd1306_command(0x8F);
    ssd1306_command(SSD1306_SETPRECHARGE);                  // 0xd9
    if (vccstate == SSD1306_EXTERNALVCC) 
      { ssd1306_command(0x22); }
    else 
      { ssd1306_command(0xF1); }
    ssd1306_command(SSD1306_SETVCOMDETECT);                 // 0xDB
    ssd1306_command(0x40);
    ssd1306_command(SSD1306_DISPLAYALLON_RESUME);           // 0xA4
    ssd1306_command(SSD1306_NORMALDISPLAY);                 // 0xA6
  #endif

  #if defined SSD1306_128_64
    // Init sequence for 128x64 OLED module
    ssd1306_command(SSD1306_DISPLAYOFF);                    // 0xAE
    ssd1306_command(SSD1306_SETDISPLAYCLOCKDIV);            // 0xD5
    ssd1306_command(0x80);                                  // the suggested ratio 0x80
    ssd1306_command(SSD1306_SETMULTIPLEX);                  // 0xA8
    ssd1306_command(0x3F);
    ssd1306_command(SSD1306_SETDISPLAYOFFSET);              // 0xD3
    ssd1306_command(0x0);                                   // no offset
    ssd1306_command(SSD1306_SETSTARTLINE | 0x0);            // line #0
    ssd1306_command(SSD1306_CHARGEPUMP);                    // 0x8D
    if (vccstate == SSD1306_EXTERNALVCC) 
      { ssd1306_command(0x10); }
    else 
      { ssd1306_command(0x14); }
    ssd1306_command(SSD1306_MEMORYMODE);                    // 0x20
    ssd1306_command(0x00);                                  // 0x0 act like ks0108
    ssd1306_command(SSD1306_SEGREMAP | 0x1);
    ssd1306_command(SSD1306_COMSCANDEC);
    ssd1306_command(SSD1306_SETCOMPINS);                    // 0xDA
    ssd1306_command(0x12);
    ssd1306_command(SSD1306_SETCONTRAST);                   // 0x81
    if (vccstate == SSD1306_EXTERNALVCC) 
      { ssd1306_command(0x9F); }
    else 
      { ssd1306_command(0xCF); }
    ssd1306_command(SSD1306_SETPRECHARGE);                  // 0xd9
    if (vccstate == SSD1306_EXTERNALVCC) 
      { ssd1306_command(0x22); }
    else 
      { ssd1306_command(0xF1); }
    ssd1306_command(SSD1306_SETVCOMDETECT);                 // 0xDB
    ssd1306_command(0x40);
    ssd1306_command(SSD1306_DISPLAYALLON_RESUME);           // 0xA4
    ssd1306_command(SSD1306_NORMALDISPLAY);                 // 0xA6
  #endif

